# 7.SQL( データベースとSQLの基礎)

- **[7.1 この章の概要](#7.1-この章の概要)**
    - [7.1.1 データベースとは](#7.1.1-データベースとは)
    - [7.1.2 RDBMS](#7.1.2-RDBMS)
<br><br>
- **[7.2 SQLの基礎](#7.2-SQLの基礎)**
    - [7.2.1 データベースとテーブルの作成](#7.2.1-データベースとテーブルの作成)
    - [7.2.2 データの検索と更新、削除、テーブルカラムの変更](#7.2.2-データの検索と更新、削除、テーブルカラムの変更)
    - [7.2.3 データの集計、演算、並び替え](#7.2.3-データの集計、演算、並び替え)
    - [7.2.4 グループごとの集計](#7.2.4-グループごとの集計)
    - [7.2.5 複数テーブルの利用](#7.2.5-複数テーブルの利用)
    - [7.2.6 case文とサブクエリ](#7.2.6-case文とサブクエリ)
<br><br>
- **[7.3 ビュー](#7.3-ビュー)**
    - [7.3.1 ビュー](#7.3.1-ビュー)
<br><br>
- **[7.4 総合問題](#7.4-総合問題)**
    - [7.4.1 総合問題1](#7.4.1-総合問題1)
    - [7.4.2 総合問題2](#7.4.2-総合問題2)

## 7.1 この章の概要
ゴール：データベースの役割を知る

### 7.1.1 データベースとは
キーワード：データベース、RDBMS

ここからはデータベースについて学んでいきます。データベースとは、簡単にいいますと、コンピューターを利用して膨大なデータをまとめて、後から色々なニーズに対して活用できるように、管理されたデータの集まりのことです。データベースには、たくさんのテーブルがあり、そのテーブルの中にデータがあります。以下が、データベースとテーブルのイメージ図です。なお、テーブルの行をレコードといい、列をカラムといいます。

![comment](http://www.webolve.com/image/basic/aboutdb/fig_02.jpg)

参照URL：http://www.webolve.com/image/basic/aboutdb/fig_02.jpg

具体的なデータとしては、ある店舗の毎日の売り上げをデータベースで管理していることもありますし、顧客の個人情報、社員の給料情報、金融の取引データ、ウェブサイトのアクセスログデータ等もデータベースで管理されたりしています。購買データでいうと、売れた商品の日時、その商品を識別するコード、購買者、その商品の値段、数量などがデータとしてテーブルに入ってきます。これらのデータは日々追加されますし、何かの集計（1ヶ月の売り上げの計算など）をするときはデータベースからデータが抽出され、必要なければ削除されます。

それでは、そもそも何故データベースが必要なのでしょうか。小さなデータで、一貫性等を求められていなければ、Excelで十分かもしれません。しかし、データは日々大きくなっていきますし、昨今は特にIoTなどが注目されており、リアルタイムに膨大な量のデータが生まれています。ビッグデータと言われる現代、データソースのテーブルに1億レコード以上あるということもしばしばあり、これをExcelで集計することは困難でしょう。データベースとそれを呼び出すためのSQLという言語を使うことで、大きなデータに対しても効率的に作業ができるのです。（ただし、昨今はビッグデータを扱う際にHadoopやSparkなどの分散処理をするソフトウェアなどが使われるようになっており、この講座でも後半の章で少し触れます。）

さらに管理するという視点でも、Excelでは限界があります。Excelは基本的に誰でも編集ができますし、後からデータに問題があった場合に対処するのが困難です。列も自由に異なるデータを入力できますし、それを統一的に扱うのは難しいです。データベースを使うことで、容易に管理できます。なお、同時にデータを変更することを避けるために、データにロックをかけて、他の人が編集できないようにすることを**「排他制御」**といい、以下のようなイメージ図になります。


![](http://image.itmedia.co.jp/ait/articles/1105/30/r501-01.gif)

参照URL：http://image.itmedia.co.jp/ait/articles/1105/30/r501-01.gif

### 7.1.2 RDBMS
キーワード：RDMBS、MySQL、テーブル

この章で学ぶデータベースのシステムは、RDBMSと言われるリレーショナルデータベースを管理するシステムです。代表的な製品に、Oracle, Microsoft SQL Server, PostgreSQL, MySQLなどがあります。ここでは、SQLITEというデータベースを使用します。以下は、データベースのイメージです。

![comment](https://www.mysql.com/common/images/products/MySQL_Workbench_Visual_Design_Windows.gif)

参照URL：https://www.mysql.com/common/images/products/MySQL_Workbench_Visual_Design_Windows.gif

なお、SQLITEの参考サイトは以下になりますので、適宜参照してください。

参照URL：https://sqlite.org/index.html

データベースにはテーブルがあり、データはそのテーブルから抽出します。テーブルは幾つかのカラム（列）から構成され、それぞれ型の異なるデータが入っています。数値型であったり、文字であったり、日時であったりします。Excelでは、同じ列に数字や文字など、色々な型のデータを混在して入れることができますが、データベースのテーブルには同じ型を指定してデータを入れる必要があります。データがそのような状態なので、後で集計がとても簡単にできます。それらの扱い方についても、後で学びます。

ここでデータベースに関する簡単な紹介は終わります。他にも色々な概念がありますが、まずはデータをハンドリングできるように、実装中心に学んでいきましょう。SQLもまた手を動かしながら学ぶことで、早く使えるようになります。

なお、以下の参考文献が初心者にはわかりやすいので、全くSQLの経験がない方は前半のみ一読をおすすめします。一部、PHPとその連携もありますが、この講座を理解するためには必要ありません。適宜、興味があれば学習して、何か簡単なウェブサービスを作ってみるのもデータベースの大変よい理解になります。

>[参考文献]
>
>『基礎からのMySQL 改訂版 (基礎からシリーズ) 』（西沢 夢路 (著)、 SBクリエイティブ）

## 7.2 SQLの基礎
ゴール：SQLの基礎的な操作方法を身につける

### 7.2.0 Google colabでSQLを使うための設定

必要なモジュールをダウンロードします

In [1]:
# IPython用のモジュールをダウンロード
!pip install jupysql duckdb-engine

Collecting jupysql
  Downloading jupysql-0.10.10-py3-none-any.whl (95 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 95.7/95.7 kB 2.9 MB/s eta 0:00:00
Collecting duckdb-engine
  Downloading duckdb_engine-0.13.0-py3-none-any.whl (47 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 47.2/47.2 kB 3.5 MB/s eta 0:00:00
Requirement already satisfied: prettytable in /usr/local/lib/python3.10/dist-packages (from jupysql) (3.10.0)
Requirement already satisfied: sqlalchemy in /usr/local/lib/python3.10/dist-packages (from jupysql) (2.0.30)
Requirement already satisfied: sqlparse in /usr/local/lib/python3.10/dist-packages (from jupysql) (0.5.0)
Requirement already satisfied: ipython-genutils>=0.1.0 in /usr/local/lib/python3.10/dist-packages (from jupysql) (0.2.0)
Requirement already satisfied: jinja2 in /usr/local/lib/python3.10/dist-packages (from jupysql) (3.1.4)
Requirement already satisfied: sqlglot>=11.3.7 in /usr/local/lib/python3.10/dist-packages (from jupysql) (20.11.0)
Collecting jupysql-plugin>=0.4.2 (from jupysql)
  Downloading jupysql_plugin-0.4.3-py3-none-any.whl (250 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 251.0/251.0 kB 7.4 MB/s eta 0:00:00
Collecting ploomber-core>=0.2.7 (from jupysql)
  Downloading ploomber_core-0.2.25-py3-none-any.whl (22 kB)
Collecting ploomber-extension (from jupysql)
  Downloading ploomber_extension-0.1.0-py3-none-any.whl (193 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 193.0/193.0 kB 8.7 MB/s eta 0:00:00
Requirement already satisfied: duckdb>=0.5.0 in /usr/local/lib/python3.10/dist-packages (from duckdb-engine) (0.10.3)
Requirement already satisfied: packaging>=21 in /usr/local/lib/python3.10/dist-packages (from duckdb-engine) (24.0)
Requirement already satisfied: pyyaml in /usr/local/lib/python3.10/dist-packages (from ploomber-core>=0.2.7->jupysql) (6.0.1)
Collecting posthog (from ploomber-core>=0.2.7->jupysql)
  Downloading posthog-3.5.0-py2.py3-none-any.whl (41 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 41.3/41.3 kB 3.3 MB/s eta 0:00:00
Requirement already satisfied: typing-extensions>=4.6.0 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy->jupysql) (4.12.0)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy->jupysql) (3.0.3)
Requirement already satisfied: MarkupSafe>=2.0 in /usr/local/lib/python3.10/dist-packages (from jinja2->jupysql) (2.1.5)
Requirement already satisfied: wcwidth in /usr/local/lib/python3.10/dist-packages (from prettytable->jupysql) (0.2.13)
Requirement already satisfied: requests<3.0,>=2.7 in /usr/local/lib/python3.10/dist-packages (from posthog->ploomber-core>=0.2.7->jupysql) (2.31.0)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.10/dist-packages (from posthog->ploomber-core>=0.2.7->jupysql) (1.16.0)
Collecting monotonic>=1.5 (from posthog->ploomber-core>=0.2.7->jupysql)
  Downloading monotonic-1.6-py2.py3-none-any.whl (8.2 kB)
Collecting backoff>=1.10.0 (from posthog->ploomber-core>=0.2.7->jupysql)
  Downloading backoff-2.2.1-py3-none-any.whl (15 kB)
Requirement already satisfied: python-dateutil>2.1 in /usr/local/lib/python3.10/dist-packages (from posthog->ploomber-core>=0.2.7->jupysql) (2.8.2)
Requirement already satisfied: charset-normalizer<4,>=2 in /usr/local/lib/python3.10/dist-packages (from requests<3.0,>=2.7->posthog->ploomber-core>=0.2.7->jupysql) (3.3.2)
Requirement already satisfied: idna<4,>=2.5 in /usr/local/lib/python3.10/dist-packages (from requests<3.0,>=2.7->posthog->ploomber-core>=0.2.7->jupysql) (3.7)
Requirement already satisfied: urllib3<3,>=1.21.1 in /usr/local/lib/python3.10/dist-packages (from requests<3.0,>=2.7->posthog->ploomber-core>=0.2.7->jupysql) (2.0.7)
Requirement already satisfied: certifi>=2017.4.17 in /usr/local/lib/python3.10/dist-packages (from requests<3.0,>=2.7->posthog->ploomber-core>=0.2.7->jupysql) (2024.2.2)
Installing collected packages: monotonic, backoff, posthog, duckdb-engine, ploomber-core, ploomber-extension, jupysql-plugin, jupysql
Successfully installed backoff-2.2.1 duckdb-engine-0.13.0 jupysql-0.10.10 jupysql-plugin-0.4.3 monotonic-1.6 ploomber-core-0.2.25 ploomber-extension-0.1.0 posthog-3.5.0

データ読み込みとデータベースの設定をします。

In [2]:
%load_ext sql
%sql duckdb://

Deploy Streamlit apps for free on Ploomber Cloud! Learn more: https://ploomber.io/s/signup

Connecting to 'duckdb://'

以降、セルの最初に

```
%%sql
```
を記載するとSQLが使えるようになります。


**※「"」は使えません。「'」を使用するようにしてください。**

また、SQLでは大文字と小文字は区別されませんが、コードの可読性と視認性を高めるために、以下のような慣例が広く用いられています。
*   予約語（SELECT、FROM、WHERE、JOIN等）は大文字で記述する
*   テーブル名やカラム名は小文字で記述する
*   複数の単語からなるテーブル名やカラム名はアンダースコア（_）で区切る

### 7.2.1 データベースとテーブルの作成
キーワード：データベース作成、テーブル、SHOW DATABASES, USE, SHOW TABLES, CREATE, SELECT

** 注意：以下、練習問題も含め、可能な限り上から実行するようにしてください。あとの問題で使います。**

テーブルを作成していきます。テーブルにデータが入り、データのカラム名とその型を指定します。実際にテーブルを作ってみましょう。以下のようにCREATE TABLEを実行しますが、要注意です。最初にテーブル名、データの型と名前等を付けています。ここではmeiboテーブルに整数型のid、文字型のnameを設定しています。さらに、PRIMAEY KEYというのは、このカラムが一意のキーとなっていることを宣言しています。つまり、同じデータは入らないということです。

In [3]:
%%sql
CREATE TABLE meibo
  (id INT PRIMARY KEY, name VARCHAR(20))

Running query in 'duckdb://'

+-------+
| Count |
+-------+
+-------+

さて、ここでテーブルからデータを引っ張る時に、以下のようにSELECT * FROM テーブル名という書き方をします。アスタリスクは、すべての列名を持ってくるという意味です。ただ、以下のSELECT文を実行しても、空のテーブルだけなので、中身は何もなく、空のレコードが表示されます。

In [4]:
%%sql
SELECT * FROM meibo;

Running query in 'duckdb://'

+----+------+
| id | name |
+----+------+
+----+------+

用意したテーブルに、データを挿入してみましょう。データの挿入はINSERT INTO を使います。その後に、「テーブル名（カラム名）VALUES 挿入したいデータ」で実行します。以下のように記述して、データを3レコード挿入しています。

In [5]:
%%sql
INSERT INTO meibo (id, name) VALUES (1, 'Yamada'); # ※シングルクオーテーションマークを使用してください

Running query in 'duckdb://'

+-------+
| Count |
+-------+
+-------+

In [6]:
%%sql
INSERT INTO meibo (id, name) VALUES (2, 'Tanaka');

Running query in 'duckdb://'

+-------+
| Count |
+-------+
+-------+

In [7]:
%%sql
INSERT INTO meibo (id, name) VALUES (3, 'Sato');

Running query in 'duckdb://'

+-------+
| Count |
+-------+
+-------+

もう一度、テーブルを確認してみましょう。

In [8]:
%%sql
SELECT * FROM meibo;

Running query in 'duckdb://'

+----+--------+
| id |  name  |
+----+--------+
| 1  | Yamada |
| 2  | Tanaka |
| 3  |  Sato  |
+----+--------+

なお、同じキーとなるidのデータを入れるとエラーが出て、以下のようになります。

In [108]:
%%sql
INSERT INTO meibo (id, name) VALUES (1, 'Yamada');

Running query in 'duckdb://'

RuntimeError: (duckdb.duckdb.ConstraintException) Constraint Error: Duplicate key "id: 1" violates primary key constraint. If this is an unexpected constraint violation please double check with the known index limitations section in our documentation (https://duckdb.org/docs/sql/indexes).
[SQL: INSERT INTO meibo (id, name) VALUES (1, 'Yamada');]
(Background on this error at: https://sqlalche.me/e/20/gkpj)
If you need help solving this issue, send us a message: https://ploomber.io/community

以下のSQLでテーブルの一覧を確認できます。

In [10]:
%%sql
SELECT name FROM sqlite_master WHERE type='table';

Running query in 'duckdb://'

+-------+
|  name |
+-------+
| meibo |
+-------+

>**[ポイント]**
>
>CREATE DATABASES [データベース名]：データベースの作成
>
>CREATE TABLE [テーブル名] [カラム名 型]：テーブルの作成
>
>CREATE TABLE [テーブル名] [カラム名 型] PRIMARY KEY：プライマリーキーの設定
>
>SELECT * FROM テーブル名：テーブル名のカラムすべてのデータを問い合わせ
>
>INSERT INTO [テーブル名] [カラム名 型] [値]：データの挿入

#### <練習問題 1>
新しいテーブル「meibo2」を作成してください。作成後はテーブルが完成しているか、確認しましょう。データのカラム名とその型はなんでも構いません。

In [11]:
%%sql
CREATE TABLE meibo2
  (id INT PRIMARY KEY, name VARCHAR(20))

Running query in 'duckdb://'

+-------+
| Count |
+-------+
+-------+

In [12]:
%%sql
SELECT name FROM sqlite_master WHERE type='table';

Running query in 'duckdb://'

+--------+
|  name  |
+--------+
| meibo  |
| meibo2 |
+--------+

#### <練習問題 2>

練習1で新しく作ったテーブルmeibo2にデータを追加してみましょう。追加後は、確かにデータが入っているか確認してください。

In [13]:
%%sql
INSERT INTO meibo2 (id, name) VALUES (1, 'Yamada');

Running query in 'duckdb://'

+-------+
| Count |
+-------+
+-------+

In [14]:
%%sql
SELECT * FROM meibo2

Running query in 'duckdb://'

+----+--------+
| id |  name  |
+----+--------+
| 1  | Yamada |
+----+--------+

### 7.2.2 データの検索と更新、削除、テーブルカラムの変更
キーワード：WHERE, IN, LIKE, UPDATE, DELETE, ALTER

次は、データの抽出をするときに、条件を絞って実行してみましょう。条件はWHERE文を使います。以下では、id=2の人のデータを抽出しています。

In [15]:
%%sql
SELECT * FROM meibo WHERE id=2;

Running query in 'duckdb://'

+----+--------+
| id |  name  |
+----+--------+
| 2  | Tanaka |
+----+--------+

次は、INを使うことでidが1か2であるレコードを抽出します。（他、データの範囲を絞り込むためBETWEENなどもありますので、調べてみてください。）

In [16]:
%%sql
SELECT * FROM meibo WHERE id IN (1,2);

Running query in 'duckdb://'

+----+--------+
| id |  name  |
+----+--------+
| 1  | Yamada |
| 2  | Tanaka |
+----+--------+

以下のような記述で、曖昧検索もできます。LIKEを使って、以下の処理では、Sからはじまって後は任意の文字列ということで、「S%」としています。他にも、「%S」や「%S%」で検索が可能です。

In [17]:
%%sql
SELECT * FROM meibo WHERE name LIKE 'S%';

Running query in 'duckdb://'

+----+------+
| id | name |
+----+------+
| 3  | Sato |
+----+------+

>**[やってみよう]**
>
>上の条件式を色々と変更してデータを検索してみましょう。例えば、idが1以外の人や、nameがaで終わる人はどのように検索しますか？

今までは存在してるデータを抽出してきましたが、次は、データを変更してみます。UPDATEを使って、id=3の人を更新してみます。記述方法は以下のようになります。

In [18]:
%%sql
UPDATE meibo
SET name = 'Suzuki'
WHERE id=3;

Running query in 'duckdb://'

+-------+
| Count |
+-------+
+-------+

更新されているか確かめてみましょう。

In [19]:
%%sql
SELECT * FROM meibo;

Running query in 'duckdb://'

+----+--------+
| id |  name  |
+----+--------+
| 1  | Yamada |
| 2  | Tanaka |
| 3  | Suzuki |
+----+--------+

データを削除する場合も扱いましょう。削除用のサンプルデータを用意(id=4)して、確認します。

In [20]:
%%sql
INSERT INTO meibo (id, name) VALUES (4, 'Dummy');

Running query in 'duckdb://'

+-------+
| Count |
+-------+
+-------+

In [21]:
%%sql
SELECT * FROM meibo;

Running query in 'duckdb://'

+----+--------+
| id |  name  |
+----+--------+
| 1  | Yamada |
| 2  | Tanaka |
| 3  | Suzuki |
| 4  | Dummy  |
+----+--------+

データの削除はDELETEを使います。ここでは、先ほど用意しましたid＝4の人を削除します。

In [22]:
%%sql
DELETE FROM meibo
WHERE id = 4;

Running query in 'duckdb://'

+-------+
| Count |
+-------+
+-------+

念のため、消えているかどうか確認しましょう。

In [23]:
%%sql
SELECT * FROM meibo;

Running query in 'duckdb://'

+----+--------+
| id |  name  |
+----+--------+
| 1  | Yamada |
| 2  | Tanaka |
| 3  | Suzuki |
+----+--------+

次は、新しいカラムを追加しましょう。その人のクラスと年齢を追加します。「ALTER TABLE テーブル名 ADD 新しいカラム名 型」です。

In [24]:
%%sql
ALTER TABLE meibo ADD class INT;

Running query in 'duckdb://'

+---------+
| Success |
+---------+
+---------+

In [25]:
%%sql
ALTER TABLE meibo ADD age INT;

Running query in 'duckdb://'

+---------+
| Success |
+---------+
+---------+

新しくカラムを追加したテーブルをチェックしてみましょう。classとageには、まだ何もデータは入っていないので、空（NULL）になります。

In [26]:
%%sql
SELECT * FROM meibo;

Running query in 'duckdb://'

+----+--------+-------+------+
| id |  name  | class | age  |
+----+--------+-------+------+
| 1  | Yamada |  None | None |
| 2  | Tanaka |  None | None |
| 3  | Suzuki |  None | None |
+----+--------+-------+------+

UPDATEを使ってデータを更新します。

In [27]:
%%sql
UPDATE meibo
SET class=1,age=13
WHERE id=3;

Running query in 'duckdb://'

+-------+
| Count |
+-------+
+-------+

id=3の人のレコードにクラスと年齢のデータが入りました。

In [28]:
%%sql
SELECT * FROM meibo;

Running query in 'duckdb://'

+----+--------+-------+------+
| id |  name  | class | age  |
+----+--------+-------+------+
| 1  | Yamada |  None | None |
| 2  | Tanaka |  None | None |
| 3  | Suzuki |   1   |  13  |
+----+--------+-------+------+

続けて、他の人のデータも更新しましょう。

In [29]:
%%sql
UPDATE meibo
SET class=1,age=14
WHERE id=1;

Running query in 'duckdb://'

+-------+
| Count |
+-------+
+-------+

In [30]:
%%sql
UPDATE meibo
SET class=2,age=13
WHERE id=2;

Running query in 'duckdb://'

+-------+
| Count |
+-------+
+-------+

In [31]:
%%sql
SELECT * FROM meibo;

Running query in 'duckdb://'

+----+--------+-------+-----+
| id |  name  | class | age |
+----+--------+-------+-----+
| 1  | Yamada |   1   |  14 |
| 2  | Tanaka |   2   |  13 |
| 3  | Suzuki |   1   |  13 |
+----+--------+-------+-----+

新しい人たちのデータを追加しましょう。先ほどはINSERTを1つ1つ実行していきました。ここでは、以下のコマンドで一度に更新します。

In [32]:
%%sql
INSERT INTO meibo (id,name,class,age)
VALUES (4,'Kato',2,15),(5,'Ito',3,12),(6,'Takeuchi',2,16),(7,'Kimura',3,11),(8,'Sato',1,14);

Running query in 'duckdb://'

+-------+
| Count |
+-------+
+-------+

データの確認をします。

In [33]:
%%sql
SELECT * FROM meibo;

Running query in 'duckdb://'

+----+----------+-------+-----+
| id |   name   | class | age |
+----+----------+-------+-----+
| 1  |  Yamada  |   1   |  14 |
| 2  |  Tanaka  |   2   |  13 |
| 3  |  Suzuki  |   1   |  13 |
| 4  |   Kato   |   2   |  15 |
| 5  |   Ito    |   3   |  12 |
| 6  | Takeuchi |   2   |  16 |
| 7  |  Kimura  |   3   |  11 |
| 8  |   Sato   |   1   |  14 |
+----+----------+-------+-----+

>**[ポイント]**
>
>SELCT * FROM [テーブル名] WHERE 条件：条件でデータを絞り込み
>
>IN：条件マッチ
>
>LIKE：曖昧検索
>
>DELETE FROM [テーブル名]：データの削除（注：条件を絞りこむ場合はWHERE文を追加する）
>
>ALTER [テーブル名] ADD [カラム名 型]:テーブルのカラム名追加
>
>UPDATE [テーブル名] SET ：データのアップデート

#### <練習問題 1>
上記のテーブルmeiboにて、id=4の人レコードを抽出してください。

In [34]:
%%sql
SELECT * FROM meibo WHERE id = 4;

Running query in 'duckdb://'

+----+------+-------+-----+
| id | name | class | age |
+----+------+-------+-----+
| 4  | Kato |   2   |  15 |
+----+------+-------+-----+

#### <練習問題 2>

上のmeiboテーブルでid=8の人のclassを7にアップデートしてください。select文でアップデートを確認できたら、id=8の人のclassを1に戻してください。

In [35]:
%%sql
SELECT * FROM meibo WHERE id = 8;

Running query in 'duckdb://'

+----+------+-------+-----+
| id | name | class | age |
+----+------+-------+-----+
| 8  | Sato |   1   |  14 |
+----+------+-------+-----+

In [36]:
%%sql
UPDATE meibo
SET class = 7
WHERE id=8;

Running query in 'duckdb://'

+-------+
| Count |
+-------+
+-------+

In [37]:
%%sql
SELECT * FROM meibo WHERE id = 8;

Running query in 'duckdb://'

+----+------+-------+-----+
| id | name | class | age |
+----+------+-------+-----+
| 8  | Sato |   7   |  14 |
+----+------+-------+-----+

In [38]:
%%sql
UPDATE meibo
SET class = 1
WHERE id=8;

Running query in 'duckdb://'

+-------+
| Count |
+-------+
+-------+

In [39]:
%%sql
 SELECT * FROM meibo WHERE id = 8;

Running query in 'duckdb://'

+----+------+-------+-----+
| id | name | class | age |
+----+------+-------+-----+
| 8  | Sato |   1   |  14 |
+----+------+-------+-----+

#### <練習問題 3>　(※必須問題：以降の問題で使います。)

上記と同じテーブルmeiboに新しい列heightという身長のカラムを追加してください。さらに、id=1から4までの人は150、id=5から6までの人は155、id=7から8までの人は160でアップデートしてください。

In [40]:
%%sql
ALTER TABLE meibo ADD height INT;

Running query in 'duckdb://'

+---------+
| Success |
+---------+
+---------+

In [41]:
%%sql
UPDATE meibo
SET height=150
WHERE id<=4;

Running query in 'duckdb://'

+-------+
| Count |
+-------+
+-------+

In [42]:
%%sql
UPDATE meibo
SET height=155
WHERE id>=5 AND id<=6;

Running query in 'duckdb://'

+-------+
| Count |
+-------+
+-------+

In [43]:
%%sql
UPDATE meibo
SET height=160
WHERE id>=7;

Running query in 'duckdb://'

+-------+
| Count |
+-------+
+-------+

In [44]:
%%sql
SELECT * FROM meibo;

Running query in 'duckdb://'

+----+----------+-------+-----+--------+
| id |   name   | class | age | height |
+----+----------+-------+-----+--------+
| 1  |  Yamada  |   1   |  14 |  150   |
| 2  |  Tanaka  |   2   |  13 |  150   |
| 3  |  Suzuki  |   1   |  13 |  150   |
| 4  |   Kato   |   2   |  15 |  150   |
| 5  |   Ito    |   3   |  12 |  155   |
| 6  | Takeuchi |   2   |  16 |  155   |
| 7  |  Kimura  |   3   |  11 |  160   |
| 8  |   Sato   |   1   |  14 |  160   |
+----+----------+-------+-----+--------+

### 7.2.3 データの集計、演算、並び替え
キーワード：COUNT, DISTINCT, ORDER, AVG, SUM, LIMIT

次は、SQLを使った集計になります。データを見るときにまず気になるのが、何レコードあるかということです。以下で、データが何行あるかカウントするために、COUNTを使っています。

In [45]:
%%sql
SELECT COUNT(*) FROM meibo;

Running query in 'duckdb://'

+--------------+
| count_star() |
+--------------+
|      8       |
+--------------+

なお、asで名前をつけることができます。エイリアスといいます。cntというカラム名をつけてみましょう。

In [46]:
%%sql
SELECT COUNT(*) AS cnt FROM meibo;

Running query in 'duckdb://'

+-----+
| cnt |
+-----+
|  8  |
+-----+

次は、このCOUNTを使って、異なる種類のデータを数えてみます。具体的には、先ほどレコード数は8レコードありましたが、異なるクラスは何クラスあるでしょうか。COUNTとDISTINCT を併用することで、重複を除いた件数をカウントできます。

In [47]:
%%sql
SELECT COUNT(DISTINCT class) AS classCnt FROM meibo;

Running query in 'duckdb://'

+----------+
| classCnt |
+----------+
|    3     |
+----------+

次は、平均を計算します。以下は、平均年齢を計算しています。AVGを使います。

In [48]:
%%sql
 SELECT AVG(age) AS avgAge FROM meibo;

Running query in 'duckdb://'

+--------+
| avgAge |
+--------+
|  13.5  |
+--------+

なお、SUM関数を使うと合計されますが、年齢の合計の用途はあまりなさそうです。ここでは、先ほどのCOUNTと組み合わせて、平均年齢を算出しましょう。上記の結果と同じになっていることがわかります。このように、SELECTの中で演算が可能です。

In [49]:
%%sql
SELECT CAST(SUM(age) AS REAL) / CAST(COUNT(*) AS REAL) AS avgAge FROM meibo;

Running query in 'duckdb://'

+--------+
| avgAge |
+--------+
|  13.5  |
+--------+

年齢最大値と最小値は以下のように記述します。最年少が11歳、最年長が16歳とわかります。

In [50]:
%%sql
SELECT MIN(age) AS minAge, MAX(age) AS maxAge FROM meibo;

Running query in 'duckdb://'

+--------+--------+
| minAge | maxAge |
+--------+--------+
|   11   |   16   |
+--------+--------+

次は、idを軸として降順に並べてみましょう。並び替えはORDER BY カラム名を使います。 DESCをつけることで、降順（大きいものから小さいものの順番）になります。

In [51]:
%%sql
SELECT * FROM meibo ORDER BY id DESC;

Running query in 'duckdb://'

+----+----------+-------+-----+--------+
| id |   name   | class | age | height |
+----+----------+-------+-----+--------+
| 8  |   Sato   |   1   |  14 |  160   |
| 7  |  Kimura  |   3   |  11 |  160   |
| 6  | Takeuchi |   2   |  16 |  155   |
| 5  |   Ito    |   3   |  12 |  155   |
| 4  |   Kato   |   2   |  15 |  150   |
| 3  |  Suzuki  |   1   |  13 |  150   |
| 2  |  Tanaka  |   2   |  13 |  150   |
| 1  |  Yamada  |   1   |  14 |  150   |
+----+----------+-------+-----+--------+

今度は、ageを軸として昇順（小さいものから大きいものの順番）に並べてみましょう。デフォルトは昇順です。

In [52]:
%%sql
SELECT * FROM meibo ORDER BY age;

Running query in 'duckdb://'

+----+----------+-------+-----+--------+
| id |   name   | class | age | height |
+----+----------+-------+-----+--------+
| 7  |  Kimura  |   3   |  11 |  160   |
| 5  |   Ito    |   3   |  12 |  155   |
| 2  |  Tanaka  |   2   |  13 |  150   |
| 3  |  Suzuki  |   1   |  13 |  150   |
| 1  |  Yamada  |   1   |  14 |  150   |
| 8  |   Sato   |   1   |  14 |  160   |
| 4  |   Kato   |   2   |  15 |  150   |
| 6  | Takeuchi |   2   |  16 |  155   |
+----+----------+-------+-----+--------+

class, ageの2つの軸で昇順に並べてみましょう。なお、優先順位は先に記述したカラムになります。この場合は、classです。

In [53]:
%%sql
SELECT * FROM meibo ORDER BY class, age;

Running query in 'duckdb://'

+----+----------+-------+-----+--------+
| id |   name   | class | age | height |
+----+----------+-------+-----+--------+
| 3  |  Suzuki  |   1   |  13 |  150   |
| 1  |  Yamada  |   1   |  14 |  150   |
| 8  |   Sato   |   1   |  14 |  160   |
| 2  |  Tanaka  |   2   |  13 |  150   |
| 4  |   Kato   |   2   |  15 |  150   |
| 6  | Takeuchi |   2   |  16 |  155   |
| 7  |  Kimura  |   3   |  11 |  160   |
| 5  |   Ito    |   3   |  12 |  155   |
+----+----------+-------+-----+--------+

LIMITを使うと行数の制限ができます。大量のデータがある場合は、LIMITを使って表示数を制限しましょう。

In [54]:
%%sql
SELECT * FROM meibo LIMIT 3;

Running query in 'duckdb://'

+----+--------+-------+-----+--------+
| id |  name  | class | age | height |
+----+--------+-------+-----+--------+
| 1  | Yamada |   1   |  14 |  150   |
| 2  | Tanaka |   2   |  13 |  150   |
| 3  | Suzuki |   1   |  13 |  150   |
+----+--------+-------+-----+--------+

次は、複数条件での絞り込みです。同時条件で絞り込む場合はANDを使います。

In [55]:
%%sql
SELECT * FROM meibo WHERE class=2 AND age>=15;

Running query in 'duckdb://'

+----+----------+-------+-----+--------+
| id |   name   | class | age | height |
+----+----------+-------+-----+--------+
| 4  |   Kato   |   2   |  15 |  150   |
| 6  | Takeuchi |   2   |  16 |  155   |
+----+----------+-------+-----+--------+

次は、OR です。どちらか片方の条件を満たすものを絞り込む場合に使います。

In [56]:
%%sql
SELECT * FROM meibo WHERE class=1 OR age>=15;

Running query in 'duckdb://'

+----+----------+-------+-----+--------+
| id |   name   | class | age | height |
+----+----------+-------+-----+--------+
| 1  |  Yamada  |   1   |  14 |  150   |
| 3  |  Suzuki  |   1   |  13 |  150   |
| 8  |   Sato   |   1   |  14 |  160   |
| 4  |   Kato   |   2   |  15 |  150   |
| 6  | Takeuchi |   2   |  16 |  155   |
+----+----------+-------+-----+--------+

>**[ポイント]**
>
>COUNT：レコードのカウント
>
>AS：エイリアス（名前をつける）
>
>DISTINCT ：重複なく区別する
>
>AVG ：平均値
>
>MAX ：最大値
>
>MIN ：最小値
>
>ORDER BY カラム名：昇順に並び替え（降順はカラム名の後にDESC）

#### <練習問題 1>
上記と同じmeiboテーブルで、異なる年齢は何種類でしょうか。

In [57]:
%%sql
SELECT COUNT(DISTINCT age) AS ageCnt FROM meibo;

Running query in 'duckdb://'

+--------+
| ageCnt |
+--------+
|   6    |
+--------+

#### <練習問題 2>
身長が一番小さい人、大きい人の身長をそれぞれ求めてください。

In [58]:
%%sql
SELECT MIN(height) AS minHeight, MAX(height) AS maxHeight FROM meibo;

Running query in 'duckdb://'

+-----------+-----------+
| minHeight | maxHeight |
+-----------+-----------+
|    150    |    160    |
+-----------+-----------+

#### <練習問題 3>
身長が155以上で、classが3のレコードを抽出してください。

In [59]:
%%sql
SELECT * FROM meibo WHERE height>=155 AND class=3;

Running query in 'duckdb://'

+----+--------+-------+-----+--------+
| id |  name  | class | age | height |
+----+--------+-------+-----+--------+
| 5  |  Ito   |   3   |  12 |  155   |
| 7  | Kimura |   3   |  11 |  160   |
+----+--------+-------+-----+--------+

### 7.2.4 グループごとの集計
キーワード：GROUP BY, HAVING

次は、SQLを使ってグループごとに集計してみましょう。似ているのはExcelのピボットテーブルの機能です。ここではクラスを軸にしてみます。次のコマンドは各クラスの人数を数えています。

In [60]:
%%sql
SELECT class, COUNT(*) AS num FROM meibo GROUP BY class;

Running query in 'duckdb://'

+-------+-----+
| class | num |
+-------+-----+
|   1   |  3  |
|   2   |  3  |
|   3   |  2  |
+-------+-----+

平均を各グループごとに算出することも可能です。最小値、最大値も同様に算出できます。

In [61]:
%%sql
SELECT class, COUNT(*) AS num, AVG(age) AS avgAge FROM meibo GROUP BY class;

Running query in 'duckdb://'

+-------+-----+--------------------+
| class | num |       avgAge       |
+-------+-----+--------------------+
|   1   |  3  | 13.666666666666666 |
|   2   |  3  | 14.666666666666666 |
|   3   |  2  |        11.5        |
+-------+-----+--------------------+

さらに条件付きで表示してみましょう。HAVING を使っています。

In [62]:
%%sql
SELECT class, AVG(age) AS avgAge FROM meibo GROUP BY class HAVING avgAge>13;

Running query in 'duckdb://'

+-------+--------------------+
| class |       avgAge       |
+-------+--------------------+
|   1   | 13.666666666666666 |
|   2   | 14.666666666666666 |
+-------+--------------------+

whereと組み合わせることもできます。

In [63]:
%%sql
SELECT class, AVG(age) AS avgAge FROM meibo WHERE age > 13 GROUP BY class;

Running query in 'duckdb://'

+-------+--------+
| class | avgAge |
+-------+--------+
|   1   |  14.0  |
|   2   |  15.5  |
+-------+--------+

WHEREとHAVINGはどちらも条件を絞っているのですが、WHEREはSELECTで抽出された中から条件を絞っていますが、HAVINGはGROUP BYでグループ化した結果から条件を絞っています。

次は、2つの軸を使った集計です。クラス×年齢でレコード数をカウントしています。

In [64]:
%%sql
SELECT class, age, COUNT(*) AS num FROM meibo GROUP BY class, age;

Running query in 'duckdb://'

+-------+-----+-----+
| class | age | num |
+-------+-----+-----+
|   1   |  13 |  1  |
|   1   |  14 |  2  |
|   2   |  13 |  1  |
|   2   |  15 |  1  |
|   2   |  16 |  1  |
|   3   |  11 |  1  |
|   3   |  12 |  1  |
+-------+-----+-----+

番号（順）で指定して集計することも可能です。なお、GROUP BY は以下のように、呼び出している列の番号で指定することもできます。ただし、わからなくなる可能性がありますので、簡易集計以外のときにはカラム名を指定することをおすすめします。

In [65]:
%%sql
SELECT class, age, COUNT(*) AS num FROM meibo GROUP BY 1, 2;

Running query in 'duckdb://'

+-------+-----+-----+
| class | age | num |
+-------+-----+-----+
|   1   |  13 |  1  |
|   1   |  14 |  2  |
|   2   |  13 |  1  |
|   2   |  15 |  1  |
|   2   |  16 |  1  |
|   3   |  11 |  1  |
|   3   |  12 |  1  |
+-------+-----+-----+

>**[ポイント]**
>
>GROUP BY：軸を設定
>
>HAVING：条件設定

#### <練習問題 1>

meiboテーブルにてクラスごとの平均身長を求めてみましょう。

In [66]:
#解答
%%sql
SELECT class, AVG(height) AS avgHeight FROM meibo GROUP BY class;

Running query in 'duckdb://'

+-------+--------------------+
| class |     avgHeight      |
+-------+--------------------+
|   1   | 153.33333333333334 |
|   2   | 151.66666666666666 |
|   3   |       157.5        |
+-------+--------------------+

#### <練習問題 2>

上に加えて、クラスごとの人数、一番小さい人と、一番大きな人の身長もそれぞれのクラスで算出しましょう。

In [67]:
#解答
%%sql
SELECT class, COUNT(*) AS cnt, MIN(height) AS minHeight, MAX(height) AS maxHeight FROM meibo GROUP BY class;

Running query in 'duckdb://'

+-------+-----+-----------+-----------+
| class | cnt | minHeight | maxHeight |
+-------+-----+-----------+-----------+
|   1   |  3  |    150    |    160    |
|   2   |  3  |    150    |    155    |
|   3   |  2  |    155    |    160    |
+-------+-----+-----------+-----------+

#### <練習問題 3>

年齢が13歳より上の人に絞って、上記と同じ項目を求めてください。

In [68]:
#解答
%%sql
SELECT class, COUNT(*) AS cnt, MIN(height) AS minHeight, MAX(height) AS maxHeight FROM meibo WHERE age > 13 GROUP BY class;

Running query in 'duckdb://'

+-------+-----+-----------+-----------+
| class | cnt | minHeight | maxHeight |
+-------+-----+-----------+-----------+
|   1   |  2  |    150    |    160    |
|   2   |  2  |    150    |    155    |
+-------+-----+-----------+-----------+

### 7.2.5 複数テーブルの利用
キーワード：UNION, UNION ALL, INNER JOIN(内部結合), OUTER JOIN(外部結合), 自己結合

次は複数のテーブルを使って、データを操作してみましょう。準備のため、テーブルを作成します。テーブルの作成は以前に学んだ方法でも作成できますが、再び作成するのは面倒なので、すでに作成したテーブルを「コピー」しましょう。以下のように CREATE で新規に作成するテーブル名を指定した後、テーブル構造を丸ごとコピーできます。

In [69]:
#前の練習問題で作成したテーブルは使わないので、一旦削除します
%%sql
DROP TABLE IF EXISTS meibo2;

Running query in 'duckdb://'

+---------+
| Success |
+---------+
+---------+

In [70]:
#class=100000は存在しないため、レコードは０
%%sql
CREATE TABLE meibo2 AS SELECT * FROM meibo WHERE class=10000;

Running query in 'duckdb://'

+-------+
| Count |
+-------+
+-------+

確認してみましょう。

In [71]:
#データの確認
%%sql
SELECT * FROM  meibo2;

Running query in 'duckdb://'

+----+------+-------+-----+--------+
| id | name | class | age | height |
+----+------+-------+-----+--------+
+----+------+-------+-----+--------+

データを追加します。なお、１行目はわざとmeiboにある同じデータ（Yamada）を入れています。結果を確認してみてください。

In [72]:
%%sql
INSERT INTO meibo2 (id, name, class, age, height)
VALUES (1,'Yamada',1,14,150),
       (9,'Nagata',4,11,160),
       (10,'Sugino',2,13,150),
       (11,'Takayama',1,14,155),
       (12,'John',3,16,165);

Running query in 'duckdb://'

+-------+
| Count |
+-------+
+-------+

In [73]:
%%sql
 SELECT * FROM  meibo2;

Running query in 'duckdb://'

+----+----------+-------+-----+--------+
| id |   name   | class | age | height |
+----+----------+-------+-----+--------+
| 1  |  Yamada  |   1   |  14 |  150   |
| 9  |  Nagata  |   4   |  11 |  160   |
| 10 |  Sugino  |   2   |  13 |  150   |
| 11 | Takayama |   1   |  14 |  155   |
| 12 |   John   |   3   |  16 |  165   |
+----+----------+-------+-----+--------+

データを結合してみましょう。UNIONを使います。なお、UNIONは重複レコードは省きますが、UNION ALLは重複も許容します。id=1の人がUNION ALLの場合2レコードあるのがわかります。

In [74]:
%%sql
SELECT * FROM meibo
UNION
SELECT * FROM meibo2;

Running query in 'duckdb://'

+----+----------+-------+-----+--------+
| id |   name   | class | age | height |
+----+----------+-------+-----+--------+
| 5  |   Ito    |   3   |  12 |  155   |
| 6  | Takeuchi |   2   |  16 |  155   |
| 1  |  Yamada  |   1   |  14 |  150   |
| 2  |  Tanaka  |   2   |  13 |  150   |
| 3  |  Suzuki  |   1   |  13 |  150   |
| 4  |   Kato   |   2   |  15 |  150   |
| 7  |  Kimura  |   3   |  11 |  160   |
| 8  |   Sato   |   1   |  14 |  160   |
| 9  |  Nagata  |   4   |  11 |  160   |
| 10 |  Sugino  |   2   |  13 |  150   |
+----+----------+-------+-----+--------+
Truncated to displaylimit of 10.

In [75]:
%%sql
SELECT * FROM meibo
UNION ALL
SELECT * FROM meibo2;

Running query in 'duckdb://'

+----+----------+-------+-----+--------+
| id |   name   | class | age | height |
+----+----------+-------+-----+--------+
| 1  |  Yamada  |   1   |  14 |  150   |
| 2  |  Tanaka  |   2   |  13 |  150   |
| 3  |  Suzuki  |   1   |  13 |  150   |
| 4  |   Kato   |   2   |  15 |  150   |
| 5  |   Ito    |   3   |  12 |  155   |
| 6  | Takeuchi |   2   |  16 |  155   |
| 7  |  Kimura  |   3   |  11 |  160   |
| 8  |   Sato   |   1   |  14 |  160   |
| 1  |  Yamada  |   1   |  14 |  150   |
| 9  |  Nagata  |   4   |  11 |  160   |
+----+----------+-------+-----+--------+
Truncated to displaylimit of 10.

テストのスコアテーブルを作成して、このmeiboテーブルと結合してみましょう。

In [76]:
%%sql
CREATE TABLE score
  (id INT PRIMARY KEY, math INT, english INT,science INT);

Running query in 'duckdb://'

+-------+
| Count |
+-------+
+-------+

scoreテーブルにサンプルデータを挿入します。

In [77]:
%%sql
INSERT INTO score (id, math, english, science)
VALUES (1,10,10,40),(2,NULL,60,100),(3,30,40,60),
       (5,25,31,10),(6,50,30,10),(8,90,100,90),
       (9,67,71,50),(11,100,40,88),(15,76,21,13);

Running query in 'duckdb://'

+-------+
| Count |
+-------+
+-------+

念のためデータが入っているかどうか確認します。

In [78]:
%%sql
SELECT * FROM score;

Running query in 'duckdb://'

+----+------+---------+---------+
| id | math | english | science |
+----+------+---------+---------+
| 1  |  10  |    10   |    40   |
| 2  | None |    60   |   100   |
| 3  |  30  |    40   |    60   |
| 5  |  25  |    31   |    10   |
| 6  |  50  |    30   |    10   |
| 8  |  90  |   100   |    90   |
| 9  |  67  |    71   |    50   |
| 11 | 100  |    40   |    88   |
| 15 |  76  |    21   |    13   |
+----+------+---------+---------+

以下でidをキーに内部結合しています。テーブル名の後に別名を簡単に付けています。（meiboはa、scoreはb）

In [79]:
%%sql
SELECT * FROM meibo a JOIN score b ON a.id=b.id;

Running query in 'duckdb://'

+----+----------+-------+-----+--------+------+------+---------+---------+
| id |   name   | class | age | height | id_1 | math | english | science |
+----+----------+-------+-----+--------+------+------+---------+---------+
| 1  |  Yamada  |   1   |  14 |  150   |  1   |  10  |    10   |    40   |
| 2  |  Tanaka  |   2   |  13 |  150   |  2   | None |    60   |   100   |
| 3  |  Suzuki  |   1   |  13 |  150   |  3   |  30  |    40   |    60   |
| 5  |   Ito    |   3   |  12 |  155   |  5   |  25  |    31   |    10   |
| 6  | Takeuchi |   2   |  16 |  155   |  6   |  50  |    30   |    10   |
| 8  |   Sato   |   1   |  14 |  160   |  8   |  90  |   100   |    90   |
+----+----------+-------+-----+--------+------+------+---------+---------+

idをキーに外部結合(左)しています。左にあるテーブルがベースになります。右にデータがいない場合は、None(NULL)になります。

In [80]:
%%sql
SELECT * FROM meibo a LEFT JOIN score b ON a.id=b.id;

Running query in 'duckdb://'

+----+----------+-------+-----+--------+------+------+---------+---------+
| id |   name   | class | age | height | id_1 | math | english | science |
+----+----------+-------+-----+--------+------+------+---------+---------+
| 1  |  Yamada  |   1   |  14 |  150   |  1   |  10  |    10   |    40   |
| 2  |  Tanaka  |   2   |  13 |  150   |  2   | None |    60   |   100   |
| 3  |  Suzuki  |   1   |  13 |  150   |  3   |  30  |    40   |    60   |
| 5  |   Ito    |   3   |  12 |  155   |  5   |  25  |    31   |    10   |
| 6  | Takeuchi |   2   |  16 |  155   |  6   |  50  |    30   |    10   |
| 8  |   Sato   |   1   |  14 |  160   |  8   |  90  |   100   |    90   |
| 4  |   Kato   |   2   |  15 |  150   | None | None |   None  |   None  |
| 7  |  Kimura  |   3   |  11 |  160   | None | None |   None  |   None  |
+----+----------+-------+-----+--------+------+------+---------+---------+

以下は、参考ですが、自分自身のテーブルと結合をする自己結合も可能です。

In [81]:
%%sql
SELECT * FROM meibo a JOIN meibo b ON a.id=b.id;

Running query in 'duckdb://'

+----+----------+-------+-----+--------+------+----------+---------+-------+----------+
| id |   name   | class | age | height | id_1 |  name_1  | class_1 | age_1 | height_1 |
+----+----------+-------+-----+--------+------+----------+---------+-------+----------+
| 1  |  Yamada  |   1   |  14 |  150   |  1   |  Yamada  |    1    |   14  |   150    |
| 2  |  Tanaka  |   2   |  13 |  150   |  2   |  Tanaka  |    2    |   13  |   150    |
| 3  |  Suzuki  |   1   |  13 |  150   |  3   |  Suzuki  |    1    |   13  |   150    |
| 4  |   Kato   |   2   |  15 |  150   |  4   |   Kato   |    2    |   15  |   150    |
| 5  |   Ito    |   3   |  12 |  155   |  5   |   Ito    |    3    |   12  |   155    |
| 6  | Takeuchi |   2   |  16 |  155   |  6   | Takeuchi |    2    |   16  |   155    |
| 7  |  Kimura  |   3   |  11 |  160   |  7   |  Kimura  |    3    |   11  |   160    |
| 8  |   Sato   |   1   |  14 |  160   |  8   |   Sato   |    1    |   14  |   160    |
+----+----------+-------+-----+--------+------+----------+---------+-------+----------+

>**[ポイント]**
>
>UNION：重複を除いた結合
>
>UNION ALL：重複ありの結合
>
>INNER JOIN：内部結合
>
>LEFT OUTER JOIN：外部結合

#### <練習問題 1>

新しくcardtbというテーブルを作成してください。ただし、カラムはid, point, money (すべてINT)を作成してください。さらに、以下のデータを挿入してください。
<br>(id,point,money) = (1,100,1000),(3,50,500),(4,30,600),(5,10,10),(7,100,1000),(8,2000,100)

In [82]:
#解答
%%sql
CREATE TABLE cardtb
  (id INT PRIMARY KEY, point INT, money INT);

Running query in 'duckdb://'

+-------+
| Count |
+-------+
+-------+

In [83]:
#解答
%%sql
INSERT INTO cardtb (id, point, money)
VALUES (1,100,1000),(3,50,500),(4,30,600),(5,10,10),(7,100,1000),(8,2000,100);

Running query in 'duckdb://'

+-------+
| Count |
+-------+
+-------+

In [84]:
#解答
%%sql
SELECT * FROM cardtb;

Running query in 'duckdb://'

+----+-------+-------+
| id | point | money |
+----+-------+-------+
| 1  |  100  |  1000 |
| 3  |   50  |  500  |
| 4  |   30  |  600  |
| 5  |   10  |   10  |
| 7  |  100  |  1000 |
| 8  |  2000 |  100  |
+----+-------+-------+

#### <練習問題 2>

meiboテーブルにidをキーとして、上記のテーブルを内部結合させてください。

In [85]:
#解答
%%sql
SELECT * FROM meibo a JOIN cardtb b ON a.id=b.id;

Running query in 'duckdb://'

+----+--------+-------+-----+--------+------+-------+-------+
| id |  name  | class | age | height | id_1 | point | money |
+----+--------+-------+-----+--------+------+-------+-------+
| 1  | Yamada |   1   |  14 |  150   |  1   |  100  |  1000 |
| 3  | Suzuki |   1   |  13 |  150   |  3   |   50  |  500  |
| 4  |  Kato  |   2   |  15 |  150   |  4   |   30  |  600  |
| 5  |  Ito   |   3   |  12 |  155   |  5   |   10  |   10  |
| 7  | Kimura |   3   |  11 |  160   |  7   |  100  |  1000 |
| 8  |  Sato  |   1   |  14 |  160   |  8   |  2000 |  100  |
+----+--------+-------+-----+--------+------+-------+-------+

#### <練習問題 3>
meiboテーブルにidをキーとして、上記のテーブルを外部結合させてください。

In [86]:
#解答
%%sql
SELECT * FROM meibo a LEFT JOIN cardtb b ON a.id=b.id;

Running query in 'duckdb://'

+----+----------+-------+-----+--------+------+-------+-------+
| id |   name   | class | age | height | id_1 | point | money |
+----+----------+-------+-----+--------+------+-------+-------+
| 1  |  Yamada  |   1   |  14 |  150   |  1   |  100  |  1000 |
| 3  |  Suzuki  |   1   |  13 |  150   |  3   |   50  |  500  |
| 4  |   Kato   |   2   |  15 |  150   |  4   |   30  |  600  |
| 5  |   Ito    |   3   |  12 |  155   |  5   |   10  |   10  |
| 7  |  Kimura  |   3   |  11 |  160   |  7   |  100  |  1000 |
| 8  |   Sato   |   1   |  14 |  160   |  8   |  2000 |  100  |
| 2  |  Tanaka  |   2   |  13 |  150   | None |  None |  None |
| 6  | Takeuchi |   2   |  16 |  155   | None |  None |  None |
+----+----------+-------+-----+--------+------+-------+-------+

### 7.2.6 CASE文とサブクエリ
キーワード：CASE文、サブクエリ

データを処理していると、条件分岐をし、それぞれを集計したいという場合があります。SQLでは条件分岐処理もできます。以下では、クラス番号が「1,2,3」ならば、それぞれ「A,B,C」というクラス名(className)が付与されるようにしています。

In [87]:
%%sql
SELECT
     id, name
    ,CASE
        WHEN class = 1 THEN 'A'
        WHEN class = 2 THEN 'B'
        WHEN class = 3 THEN 'C'
        ELSE 'others'
    END AS className
FROM
    meibo;

Running query in 'duckdb://'

+----+----------+-----------+
| id |   name   | className |
+----+----------+-----------+
| 1  |  Yamada  |     A     |
| 2  |  Tanaka  |     B     |
| 3  |  Suzuki  |     A     |
| 4  |   Kato   |     B     |
| 5  |   Ito    |     C     |
| 6  | Takeuchi |     B     |
| 7  |  Kimura  |     C     |
| 8  |   Sato   |     A     |
+----+----------+-----------+

次は「サブクエリ」といいます。サブクエリを使用すると、元となるテーブルから必要な情報を取り出し、さらにそれをテーブルとして取り扱うことができます。この例ではmeiboテーブルの内容をサブクエリを用いてテーブルbとして扱っています。

In [88]:
%%sql
SELECT b.name,b.age FROM
  (SELECT a.age, a.name FROM meibo a WHERE a.class = 1) b;

Running query in 'duckdb://'

+--------+-----+
|  name  | age |
+--------+-----+
| Yamada |  14 |
| Suzuki |  13 |
|  Sato  |  14 |
+--------+-----+

なお、上記はカラム名を指定していますが、全てのカラムをもってきたい場合は、エイリアス名の後にドットアスタリスク（.*）をつけます。

In [89]:
%%sql
SELECT b.* FROM
  (SELECT a.* FROM meibo a WHERE a.class = 1) b;

Running query in 'duckdb://'

+----+--------+-------+-----+--------+
| id |  name  | class | age | height |
+----+--------+-------+-----+--------+
| 1  | Yamada |   1   |  14 |  150   |
| 3  | Suzuki |   1   |  13 |  150   |
| 8  |  Sato  |   1   |  14 |  160   |
+----+--------+-------+-----+--------+

以上で、SQLの基礎的な操作は完了です。練習問題の後は、ビューについて学びます。

>**[ポイント]**
>
>CASE WHEN 条件 THEN A ELSE B END AS カラム名設定：条件分岐

#### <練習問題 1>

meiboテーブルで、heightが155未満の場合は"below_155"、155ぴったりならば"equal_155"、155より大きいならば"over_155"と名付けて、テーブルを表示させてください。

In [90]:
#解答
%%sql
SELECT
     id
    ,name
    ,CASE
        WHEN height <155 THEN 'below_155'
        WHEN height = 155 THEN 'equal_155'
        WHEN height > 155 THEN 'over_155'
        ELSE 'others'
    END AS heightLevel
FROM
    meibo;

Running query in 'duckdb://'

+----+----------+-------------+
| id |   name   | heightLevel |
+----+----------+-------------+
| 1  |  Yamada  |  below_155  |
| 2  |  Tanaka  |  below_155  |
| 3  |  Suzuki  |  below_155  |
| 4  |   Kato   |  below_155  |
| 5  |   Ito    |  equal_155  |
| 6  | Takeuchi |  equal_155  |
| 7  |  Kimura  |   over_155  |
| 8  |   Sato   |   over_155  |
+----+----------+-------------+

#### <練習問題 2>
上記のテーブルとサブクエリの考え方を利用して、それぞれのheightLevel(練習問題1で付与した列)の人数を求めてください。

In [91]:
#解答
%%sql
SELECT b.heightLevel, COUNT(*) AS cnt
FROM
(SELECT
     id
    ,name
    ,CASE
        WHEN height <155 THEN 'below_155'
        WHEN height = 155 THEN 'equal_155'
        WHEN height > 155 THEN 'over_155'
        ELSE 'others'
    END AS heightLevel
FROM
    meibo) b
GROUP BY heightLevel;

Running query in 'duckdb://'

+-------------+-----+
| heightLevel | cnt |
+-------------+-----+
|  below_155  |  4  |
|  equal_155  |  2  |
|   over_155  |  2  |
+-------------+-----+

#### <練習問題 3>
上記のテーブルとサブクエリの考え方を利用して、それぞれのheightLevel(練習問題1で付与した列)の平均年齢を求めてください。

In [92]:
#解答
%%sql
SELECT b.heightLevel, AVG(age) AS avgAge
FROM
(SELECT
     id
    ,name
    ,age
    ,CASE
        WHEN height <155 THEN 'below_155'
        WHEN height = 155 THEN 'equal_155'
        WHEN height > 155 THEN 'over_155'
        ELSE 'others'
    END AS heightLevel
FROM
    meibo) b
GROUP BY heightLevel;

Running query in 'duckdb://'

+-------------+--------+
| heightLevel | avgAge |
+-------------+--------+
|  below_155  | 13.75  |
|  equal_155  |  14.0  |
|   over_155  |  12.5  |
+-------------+--------+

## 7.3 ビュー
ゴール：ビューの概念を理解し、作成や操作ができる

### 7.3.1 ビュー
キーワード：ビュー

次は、ビューについて学びます。これまでは、直接テーブルからデータを問い合わせて、必要な情報を取得していましたが、毎回条件を設定して各テーブルからデータを抽出するのは、少し面倒です。とはいえ、必要な情報を各テーブルから取得したテーブルを作成したとしても、元データの更新のたびにそのテーブルも更新する必要があるので、やはり面倒です。このようなとき、ビューを活用することで、常に最新のデータを簡単に抽出することができるようになります。ビューは、あらかじめ検索する方法を記録させておく仮想のテーブルです。

ビューの作成方法はテーブルとほぼ同じで、CREATE VIEWを使います。まずは、簡単な例からみていきましょう。meiboテーブルから、idとnameだけを持ってくるビューを作成しています。

In [93]:
%%sql
CREATE VIEW v1
    AS
SELECT id, name
    FROM meibo;

Running query in 'duckdb://'

+-------+
| Count |
+-------+
+-------+

新しいビューができているか見てみましょう。やり方は以前学んだ方法と同じです。

In [94]:
%%sql
SELECT * FROM v1;

Running query in 'duckdb://'

+----+----------+
| id |   name   |
+----+----------+
| 1  |  Yamada  |
| 2  |  Tanaka  |
| 3  |  Suzuki  |
| 4  |   Kato   |
| 5  |   Ito    |
| 6  | Takeuchi |
| 7  |  Kimura  |
| 8  |   Sato   |
+----+----------+

これだけだとあまりビューの便利さわからないので、次の例を見てみましょう。前に作成した少し複雑なテーブルもビューを作成しておけば、いつでも呼び出すことができます。

In [95]:
%%sql
CREATE VIEW v2
    AS
SELECT
     id
    ,name
    ,CASE
        WHEN class = 1 THEN 'A'
        WHEN class = 2 THEN 'B'
        WHEN class = 3 THEN 'C'
        ELSE 'others'
    END AS className
FROM
    meibo;

Running query in 'duckdb://'

+-------+
| Count |
+-------+
+-------+

以下のビューを設定しておけば、欲しい検索結果を以下のようなSQL文だけで呼び出すことができます。

In [96]:
%%sql
SELECT * FROM v2;

Running query in 'duckdb://'

+----+----------+-----------+
| id |   name   | className |
+----+----------+-----------+
| 1  |  Yamada  |     A     |
| 2  |  Tanaka  |     B     |
| 3  |  Suzuki  |     A     |
| 4  |   Kato   |     B     |
| 5  |   Ito    |     C     |
| 6  | Takeuchi |     B     |
| 7  |  Kimura  |     C     |
| 8  |   Sato   |     A     |
+----+----------+-----------+

SQLITEではビューを更新することはできません。

In [107]:
%%sql
INSERT INTO v1 (id, name) VALUES (100, 'dummy_Yamada');

Running query in 'duckdb://'

RuntimeError: (duckdb.duckdb.CatalogException) Catalog Error: v1 is not an table
[SQL: INSERT INTO v1 (id, name) VALUES (100, 'dummy_Yamada');]
(Background on this error at: https://sqlalche.me/e/20/f405)
If you need help solving this issue, send us a message: https://ploomber.io/community

以下のコマンドで、ビューであることわかります。

In [98]:
%%sql
SELECT name, SQL FROM sqlite_master WHERE type = 'view';

Running query in 'duckdb://'

+------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| name |                                                                                          sql                                                                                          |
+------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
|  v1  |                                                                    CREATE VIEW v1 AS SELECT id, "name" FROM meibo;                                                                    |
|  v2  | CREATE VIEW v2 AS SELECT id, "name", CASE  WHEN (("class" = 1)) THEN ('A') WHEN (("class" = 2)) THEN ('B') WHEN (("class" = 3)) THEN ('C') ELSE 'others' END AS className FROM meibo; |
+------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+

#### <練習問題 1>
テーブルmeibo2からidとnameを取り出して、ビューのv3を作成してみましょう。

In [99]:
#解答
%%sql
CREATE VIEW v3
    AS
SELECT id, name
    FROM meibo2;

Running query in 'duckdb://'

+-------+
| Count |
+-------+
+-------+

In [100]:
#解答
%%sql
SELECT * FROM v3;

Running query in 'duckdb://'

+----+----------+
| id |   name   |
+----+----------+
| 1  |  Yamada  |
| 9  |  Nagata  |
| 10 |  Sugino  |
| 11 | Takayama |
| 12 |   John   |
+----+----------+

#### <練習問題 2>
meiboテーブルとscoreテーブルを内部結合して、idとnameを取り出すビューv4を作成してみましょう。

In [101]:
#解答
%%sql
CREATE VIEW v4
    AS
SELECT a.id, a.name FROM meibo a JOIN score b on a.id=b.id;

Running query in 'duckdb://'

+-------+
| Count |
+-------+
+-------+

In [102]:
#解答
%%sql
SELECT * FROM v4;

Running query in 'duckdb://'

+----+----------+
| id |   name   |
+----+----------+
| 1  |  Yamada  |
| 2  |  Tanaka  |
| 3  |  Suzuki  |
| 5  |   Ito    |
| 6  | Takeuchi |
| 8  |   Sato   |
+----+----------+

***

## 7.4 総合問題

### 7.4.1 総合問題1

TEST1のデータベースを使って、次の問いに答えてください。

(1) 7.2.1で作成したmeiboテーブルと7.2.5 練習問題1で作成したcardtbテーブルの両方にデータがある人に対して、それをVIEWテーブルclass_avg_tbとして、作成してください。さらに、そのVIEWに対して、クラスごとの平均moneyを求めてください。

In [109]:
#解答
%%sql
CREATE VIEW class_avg_tb
    AS
SELECT * FROM meibo a JOIN cardtb b on a.id=b.id;

Running query in 'duckdb://'

+-------+
| Count |
+-------+
+-------+

In [111]:
#解答
%%sql
SELECT * FROM class_avg_tb;

Running query in 'duckdb://'

+----+--------+-------+-----+--------+------+-------+-------+
| id |  name  | class | age | height | id_1 | point | money |
+----+--------+-------+-----+--------+------+-------+-------+
| 1  | Yamada |   1   |  14 |  150   |  1   |  100  |  1000 |
| 3  | Suzuki |   1   |  13 |  150   |  3   |   50  |  500  |
| 4  |  Kato  |   2   |  15 |  150   |  4   |   30  |  600  |
| 5  |  Ito   |   3   |  12 |  155   |  5   |   10  |   10  |
| 7  | Kimura |   3   |  11 |  160   |  7   |  100  |  1000 |
| 8  |  Sato  |   1   |  14 |  160   |  8   |  2000 |  100  |
+----+--------+-------+-----+--------+------+-------+-------+

In [112]:
#解答
%%sql
SELECT class, AVG(money) FROM class_avg_tb
GROUP BY class;

Running query in 'duckdb://'

+-------+-------------------+
| class |     avg(money)    |
+-------+-------------------+
|   1   | 533.3333333333334 |
|   2   |       600.0       |
|   3   |       505.0       |
+-------+-------------------+

(2) (1)で作成したVIEWテーブルに対して、moneyが100未満の人のグループをx、100以上で1000未満のグループをy、1000以上のグループをzとして、それぞれのグループの平均pointを求めてください。

In [113]:
#解答
%%sql
SELECT moneyClass, AVG(point) AS avg_point
FROM
(
    SELECT
        CASE
            WHEN money<100 THEN 'x'
            WHEN money>=100 and money<1000 THEN 'y'
            WHEN money>=1000 THEN 'z'
        END AS moneyClass
        ,point
    FROM class_avg_tb
 )
GROUP BY
    moneyClass
ORDER BY
    avg_point;

Running query in 'duckdb://'

+------------+-------------------+
| moneyClass |     avg_point     |
+------------+-------------------+
|     x      |        10.0       |
|     z      |       100.0       |
|     y      | 693.3333333333334 |
+------------+-------------------+